var data = {
  "update": "2019-03-12 20:54",
  "events": [
    {

      "month": "2019.03",
      "items": [
        {
          "id": "20190309",
          "title": "03.09 第三届厨王争霸（黑暗料理大赛）",
          "content": [
            {
              "txt": "黑暗料理大赛"
            },
            {
              "txt": "陈总坏债日"
            }
          ],
          "imgs": [
            {
              "url": "https://i.loli.net/2019/03/12/5c871e0492e38.gif"
            },
            {
              "url": "https://i.loli.net/2019/03/12/5c871ea0064ca.png"
            },
            {
              "url": "https://i.loli.net/2019/03/12/5c871eb437eb5.png"
            },
            {
              "url": "https://i.loli.net/2019/03/12/5c871ec1a65ac.png"
            },
            {
              "url": "https://i.loli.net/2019/03/12/5c871ec7c69dd.png"
            },
            {
              "url": "https://i.loli.net/2019/03/12/5c871ed7d05d7.png"
            },
            {
              "url": "https://i.loli.net/2019/03/12/5c871ece11e6a.png"
            }

          ]
        }
      ]
    },
    {

      "month": "2019.02",
      "items": [
        {
          "id": "20190223",
          "title": "02.23 德云第一届运动会",
          "content": [
            {
              "txt": "第一届运动会在两小时内匆匆拉下帷幕"
            },
            {
              "txt": "决战400米贴吧的王中途退赛英雄联盟分部获得胜利"
            }
          ],
          "imgs": [
            {
              "url": "https://i.loli.net/2019/03/12/5c8715ffd9838.png"
            },
            {
              "url": "https://i.loli.net/2019/03/12/5c87162014c43.gif"
            },
            {
              "url": "https://i.loli.net/2019/03/12/5c871629d15f0.png"
            },
            {
              "url": "https://i.loli.net/2019/03/12/5c87163b1a65b.png"
            },
            {
              "url": "https://i.loli.net/2019/03/12/5c87183b71d6d.gif"
            },
            {
              "url": "https://i.loli.net/2019/03/12/5c871857a308f.png"
            }

          ]
        }
      ]
    },
      {
        "month": "2019.01",
        "items": [
             {

      "month": "2019.3",
      "items": [
        {
          "id": "20190309",
          "title": "03.09 第三届厨王争霸（黑暗料理大赛）",
          "content": [
            {
              "txt": "黑暗料理大赛"
            },
            {
              "txt": "陈总坏债日"
            }
          ],
          "imgs": [
            {
              "url": "https://i.loli.net/2019/03/12/5c871e0492e38.gif"
            },
            {
              "url": "https://i.loli.net/2019/03/12/5c871ea0064ca.png"
            },
            {
              "url": "https://i.loli.net/2019/03/12/5c871eb437eb5.png"
            },
            {
              "url": "https://i.loli.net/2019/03/12/5c871ec1a65ac.png"
            },
            {
              "url": "https://i.loli.net/2019/03/12/5c871ec7c69dd.png"
            },
            {
              "url": "https://i.loli.net/2019/03/12/5c871ed7d05d7.png"
            },
            {
              "url": "https://i.loli.net/2019/03/12/5c871ece11e6a.png"
            }

          ]
        }
      ]
    },
    {

      "month": "2019.2",
      "items": [
        {
          "id": "20190223",
          "title": "02.23 德云第一届运动会",
          "content": [
            {
              "txt": "第一届运动会在两小时内匆匆拉下帷幕"
            },
            {
              "txt": "决战400米贴吧的王中途退赛英雄联盟分部获得胜利"
            }
          ],
          "imgs": [
            {
              "url": "https://i.loli.net/2019/03/12/5c8715ffd9838.png"
            },
            {
              "url": "https://i.loli.net/2019/03/12/5c87162014c43.gif"
            },
            {
              "url": "https://i.loli.net/2019/03/12/5c871629d15f0.png"
            },
            {
              "url": "https://i.loli.net/2019/03/12/5c87163b1a65b.png"
            },
            {
              "url": "https://i.loli.net/2019/03/12/5c87183b71d6d.gif"
            },
            {
              "url": "https://i.loli.net/2019/03/12/5c871857a308f.png"
            }

          ]
        }
      ]
    },
            {
                "id": "20190105",
                "title": "01.05 DYS第二届雀圣大赛",
                "content": [
                    {
                        "txt": "孙赌圣连输苦力小李，癞蛤宝，双蛋瓦斯;人送外号孙一把，太伤。"
                    },
                    {
                        "txt": "卑微小孙守望者"
                    }
                ],
                "imgs": [
                    {
                        "url": "https://i.loli.net/2019/01/08/5c3412590620a.jpg"
                    },
                    {
                        "url": "https://i.loli.net/2019/01/08/5c34127c8ef84.jpg"
                    },
                    {
                        "url": "https://i.loli.net/2019/01/08/5c343b23e010f.jpg"
                    }
                ]
            },
            {
              "id": "20190119",
              "title": "01.19 德云第一届摔跤大赛",
              "content": [
                  {
                      "txt": "三代目获得冠军！小孩游神虽败犹荣拿下最佳潜力奖和第二名！"
                  },
                  {
                      "txt": "元气不负众望垫底"
                  }
              ],
              "imgs": [
                  {
                      "url": "https://wx2.sinaimg.cn/mw690/00666l46gy1fzbqbc612zj30dw0ajjss.jpg"
                  },
                  {
                      "url": "https://wx1.sinaimg.cn/mw690/00666l46ly1fzc96hp879j30ty0g642r.jpg"
                  },
                  {
                      "url": "https://wx4.sinaimg.cn/mw690/00666l46ly1fzc96i6o8yj30qo0hcmzc.jpg"
                  },
                  {
                      "url": "https://wx1.sinaimg.cn/mw690/00666l46ly1fzc96j4hy2j30p00ciacn.jpg"
                  }
              ],
              "link": [
                {
                  "title": "德云色第一届摔跤大赛：Kid大战西卡",
                  "url": "http://video.duowan.com/play/9006463.html"
                }
              ]
          }
        ]
      },
    {

      "month": "2018.12",
      "items": [
        {
          "id": "20181203",
          "title": "12.03 DYS第一届雀圣大赛",
          "content": [
            {
              "txt": "卡子养菊花中的周一集体活动"
            },
            {
              "txt": "四人全部洗白两次, 最终元气一把运气最不霉拿到冠军jb"
            },
            {
              "txt": "卡子哥气的发微博, 菊花都要炸裂了"
            }
          ],
          "imgs": [
            {
              "url": "https://i.loli.net/2018/12/04/5c0643e36130f.png"
            },
            {
              "url": "https://i.loli.net/2018/12/04/5c06450a6d2ff.jpg"
            }
          ]
        },
        {
          "id": "20181231",
          "title": "12.31 DYS2018跨年夜",
          "content": [
              {
                  "txt": "DYS一年总结，集体合影"
              }
          ],
          "imgs": [
              {
                  "url": "https://i.loli.net/2019/01/02/5c2c6c34e9aaa.jpg"
              }
          ]
        }
      ]
    },
    {
      "month": "2018.11",
      "items": [
        {
          "id": "20181112",
          "title": "11.12 德云色第一届老总抽奖上头衔",
          "content": [
            {
              "txt": "德云2018第一届 闪电超跑王 Darknessflame"
            },
            {
              "txt": "李哥点评--又是富二代，又有狗运"
            },
            {
              "txt": "德云2018第一届 黄金大炮王 Dysw 存粹的狗运 平民王者"
            },
            {
              "txt": "孙哥点评--看德云色中奖N次，单车变摩托"
            }
          ],
          "imgs": [
            {
              "url": "https://i.loli.net/2018/11/12/5be97f80bbd24.jpeg"
            },
            {
              "url": "https://i.loli.net/2018/11/12/5be97f2d2b3fe.jpeg"
            }
          ]
        },
        {
          "id": "20181113",
          "title": "11.13 第二届德云厨王争霸",
          "content": [
            {
              "txt": "第二届德云厨王争霸"
            },
            {
              "txt": "老总末日"
            }
          ],
          "imgs": [
            {
              "url": "https://wx4.sinaimg.cn/mw690/00666l46gy1fx71iz2y3cj30qo0dcacj.jpg"
            },
            {
              "url": "https://wx3.sinaimg.cn/mw690/00666l46gy1fx71izebbej30g4092q3z.jpg"
            },
            {
              "url": "https://wx2.sinaimg.cn/mw690/00666l46gy1fx71iy8vscj30qo0ez77c.jpg"
            },
            {
              "url": "https://wx2.sinaimg.cn/mw690/00666l46gy1fx71izr35tj30g40920tb.jpg"
            },
            {
              "url": "https://wx4.sinaimg.cn/mw690/00666l46gy1fx71izvxn8j30eo08d3z7.jpg"
            },
            {
              "url": "https://wx1.sinaimg.cn/mw690/00666l46gy1fx71j00zzuj30g4092gm1.jpg"
            }
          ]
        },
        {
          "id": "20181121",
          "title": "11.21 🔥🐔",
          "content": [
            {
              "txt": "🐸 火烧金针菇"
            }
          ],
          "imgs": [
            {
              "url": "https://i.loli.net/2018/11/22/5bf65ab23d560.jpg"
            },
            {
              "url": "https://i.loli.net/2018/11/22/5bf65bf07088e.jpg"
            }
          ]
        },
        {
          "id": "20181129",
          "title": "11.29 卡痔哥退位",
          "content": [
            {
              "txt": "11.22 卡痔哥退位割痔疮，李家哀乐相送。"
            },
            {
              "txt": "卡痔哥离开后一秒，孙子哥开始放春节序曲。"
            },
            {
              "txt": "孙家大胜利，李家转入地下。"
            },
            {
              "txt": "11.23 不过第二天卡痔哥更新微博, 主刀医生好似病了, 手术延期. 孙家狂欢先稍一稍"
            },
            {
              "txt": "11.29 卡子哥 手术成功, 平安"
            }
          ],
          "imgs": [
            {
              "url": "https://i.loli.net/2018/11/23/5bf81445378da.png"
            },
            {
              "url": "https://i.loli.net/2018/11/23/5bf814536a849.png"
            },
            {
              "url": "https://i.loli.net/2018/11/24/5bf82441a073e.png"
            },
            {
              "url": "https://i.loli.net/2018/11/29/5bff756b9dba0.jpg"
            }
          ]
        }
      ]
    },
    {
      "month": "2018.10",
      "items": [
        {
          "id": "20181009",
          "title": "10.09 新梗 小荷才露尖尖角生",
          "content": [
            {
              "txt": "直接看图 懂得都懂"
            }
          ],
          "imgs": [
            {
              "url": "https://i.loli.net/2018/10/30/5bd844c62363e.gif"
            },
            {
              "url": "https://i.loli.net/2018/10/30/5bd844c650d8e.jpg"
            }
          ],
          "link": [
            {
              "url": "https://www.bilibili.com/video/av33520345/?p=7",
              "title": "B站录播p7 55:34"
            }
          ]
        },
        {
          "id": "20181029",
          "title": "10.29 DYS 第一届 '奇葩说'辩论赛",
          "content": [
            {
              "txt": "辩题：如果Kid没有退役 顶替掉Duke，那么今年S8 iG 还能打进决赛吗？"
            },
            {
              "txt": "孙哥主持，太强了不参赛，以免比赛索然无味"
            },
            {
              "txt": "这个辩题是在 Kid 再次请假，然而其他直播员正常上班的周一零点举办的，所以这告诉我们一个道理，不要在别人正常上班的时候请假。"
            },
            {
              "txt": "正反方疯狂 Diss 我孩神"
            },
            {
              "txt": "最后反方 '便手'(癞疙宝、三代目、元气) 以微弱票数获得胜利"
            }
          ],
          "imgs": [
            {
              "url": "https://i.loli.net/2018/10/30/5bd844c5c2506.jpg"
            }
          ],
          "link": [
            {
              "url": "https://www.bilibili.com/video/av34941325",
              "title": "B站录播 德云色便论带会"
            }
          ]
        }
      ]
    },
    {
      "month": "2018.09",
      "items": [
        {
          "id": "20180907",
          "title": "09.07 加入 企鹅电竞首秀 企鹅一哥 成了",
          "content": [
            {
              "txt": "休整7天后"
            },
            {
              "txt": "德云色全员 企鹅电竞首秀, 企鹅首次带会"
            }
          ],
          "imgs": [
            {
              "url": "https://i.loli.net/2018/10/30/5bd844569883c.jpg"
            }
          ]
        }
      ]
    },
    {
      "month": "2018.08",
      "items": [
        {
          "id": "20180831",
          "title": "08.31 离开 龙珠直播 感谢祭",
          "content": [
            {
              "txt": "德云色全员 龙珠直播感谢祭，礼物🎁狂送不止"
            }
          ],
          "imgs": [
            {
              "url": "https://i.loli.net/2018/10/30/5bd844565327e.jpg"
            }
          ]
        }
      ]
    },
    {
      "month": "2018.07",
      "items": [
        {
          "id": "20180709",
          "title": "07.09 DYS第一届厨艺大赛",
          "content": [
            {
              "txt": "DYS第一届厨艺大赛"
            },
            {
              "txt": "米米的糖醋小排??，元气的火腿肠蛋，李哥的鱼，Kid的青椒炒蛋，孙哥的李庄白肉"
            },
            {
              "txt": "泡吧老板受死吧"
            }
          ],
          "imgs": [
            {
              "url": "https://i.loli.net/2018/10/30/5bd843f5a1708.png"
            },
            {
              "url": "https://i.loli.net/2018/10/30/5bd843f5ec978.png"
            },
            {
              "url": "https://i.loli.net/2018/10/30/5bd843f5b1007.png"
            },
            {
              "url": "https://i.loli.net/2018/10/30/5bd843f5af754.png"
            },
            {
              "url": "https://i.loli.net/2018/10/30/5bd84455f2ed8.png"
            },
            {
              "url": "https://i.loli.net/2018/10/30/5bd844562b9da.png"
            },
            {
              "url": "https://i.loli.net/2018/10/30/5bd844562536a.png"
            }
          ],
          "link": [
            {
              "title": "DYS 黑暗料理大赛",
              "url": "https://www.bilibili.com/video/av26525733"
            }
          ]
        }
      ]
    },
    {
      "month": "2018.06",
      "items": [
        {
          "id": "20180611",
          "title": "06.11 德云色 VS 疼痒集团 篮球赛",
          "content": [
            {
              "txt": "DYS 全体演技上线，影帝级的表现"
            },
            {
              "txt": "DYS vs 疼痒集团，篮球比赛，哈哈哈哈。一群两百斤之间的战争"
            }
          ],
          "imgs": [
            {
              "url": "https://i.loli.net/2018/10/30/5bd8437988fe6.gif"
            },
            {
              "url": "https://i.loli.net/2018/10/30/5bd84379ce371.gif"
            },
            {
              "url": "https://i.loli.net/2018/10/30/5bd84378b29c9.jpg"
            },
            {
              "url": "https://i.loli.net/2018/10/30/5bd843f4e0199.png"
            }
          ],
          "link": [
            {
              "url": "https://www.bilibili.com/video/av24711319",
              "title": "B站录像"
            }
          ]
        }
      ]
    },
    {
      "month": "2018.05",
      "items": [
        {
          "id": "20180507",
          "title": "05.07",
          "content": [
            {
              "txt": "孙哥离婚，新梗诞生 抽离婚证"
            }
          ],
          "imgs": [
            {
              "url": "https://i.loli.net/2018/10/30/5bd84378a9f3a.jpg"
            }
          ]
        }
      ]
    },
    {
      "month": "2018.04",
      "items": [
        {
          "id": "20180407",
          "title": "04.07 新梗 虎扑36少",
          "content": [
            {
              "txt": "米米解说吃鸡比赛,虎扑论坛讨论帖有36页之多，从此 虎扑36少成了"
            }
          ],
          "imgs": [
            {
              "url": "https://i.loli.net/2018/10/30/5bd84378309c6.jpg"
            }
          ],
          "link": [
            {
              "url": "https://bbs.hupu.com/21889673.html",
              "title": "讨论帖"
            }
          ]
        }
      ]
    },
    {
      "month": "2018.02",
      "items": [
        {
          "id": "20180212",
          "title": "02.12",
          "content": [
            {
              "txt": "孙哥结婚 图片就不放了吧"
            }
          ],
          "imgs": []
        }
      ]
    },
    {
      "month": "2018.01",
      "items": [
        {
          "id": "20180107",
          "title": "01.07 加入 龙珠 首播",
          "content": [
            {
              "txt": "斗鱼合同到期 新东家 龙珠直播"
            }
          ],
          "imgs": [
            {
              "url": "https://i.loli.net/2018/10/30/5bd842ea36637.jpg"
            }
          ]
        }
      ]
    },
    {
      "month": "2017.11",
      "items": [
        {
          "id": "20171122",
          "title": "11.22 新梗 百万一心屠狗日 黑光剑圣怒斩大宦人",
          "content": [
            {
              "txt": "22日晚德云色 屠狗大宦人"
            }
          ],
          "imgs": [
            {
              "url": "https://i.loli.net/2018/10/30/5bd842ea0e501.jpg"
            }
          ],
          "link": [
            {
              "url": "https://www.bilibili.com/video/av16590186?from=search&seid=12870732571735526547",
              "title": "战争世界 引爆全场，感谢大毛"
            }
          ]
        }
      ]
    },
    {
      "month": "2017.10",
      "items": [
        {
          "id": "20161026",
          "title": "10.26 新梗 表面兄弟",
          "content": [
            {
              "txt": "表面兄弟 万字微博"
            }
          ],
          "imgs": [
            {
              "url": "https://i.loli.net/2018/10/30/5bd840526e15a.jpg"
            }
          ]
        }
      ]
    },
    {
      "month": "2017.09",
      "items": [
        {
          "id": "20170915",
          "title": "09.15 德云色二台成立 米米 首秀",
          "content": [
            {
              "txt": "德云色二台成立"
            },
            {
              "txt": "那时 米米 还没有大肚腩，还不叫癞疙宝"
            }
          ],
          "imgs": [
            {
              "url": "https://i.loli.net/2018/10/30/5bd842e924d3c.jpg"
            }
          ]
        },
        {
          "id": "20170919",
          "title": "09.19 新梗 3000人小主播",
          "content": [
            {
              "txt": "斗鱼合同将到期，为打击主播签约薪水，限制人气被活捉"
            }
          ],
          "imgs": [
            {
              "url": "https://i.loli.net/2018/10/30/5bd842e949249.jpg"
            },
            {
              "url": "https://i.loli.net/2018/10/30/5bd842e9469e7.jpg"
            }
          ]
        }
      ]
    },
    {
      "month": "2016.08",
      "items": [
        {
          "id": "20160801",
          "title": "08.01 爱神 下线",
          "content": [
            {
              "txt": "录男一代目离开--Acfun爱神"
            }
          ],
          "imgs": [
            {
              "url": "https://i.loli.net/2018/10/30/5bd8403ee4543.jpg"
            }
          ]
        }
      ]
    },
    {
      "month": "2016.07",
      "items": [
        {
          "id": "20160703",
          "title": "07.03 超神偶像 夜蝶",
          "content": [
            {
              "txt": "首次参加超神偶像节目 这时候也是西卡顶峰颜值 丫儿咯 那帮snh48水都要乱流"
            }
          ],
          "imgs": [
            {
              "url": "https://i.loli.net/2018/10/30/5bd8403e40288.jpg"
            },
            {
              "url": "https://i.loli.net/2018/10/30/5bd8403f8b584.jpg"
            }
          ]
        }
      ]
    },
    {
      "month": "2016.04",
      "items": [
        {
          "id": "20160421",
          "title": "04.21 西卡直播落泪 为情伤",
          "content": [
            {
              "txt": "西卡直播落泪 网恋·甜甜圈"
            }
          ],
          "imgs": [
            {
              "url": "https://i.loli.net/2018/10/30/5bd8404aaa63b.jpg"
            }
          ]
        }
      ]
    },
    {
      "month": "2015.09",
      "items": [
        {
          "id": "20150909",
          "title": "09.09 黑总世界休闲体育大会亚军",
          "content": [
            {
              "txt": "青岛2015世界休闲体育大会“铁幕杯”国际电子竞技比赛"
            },
            {
              "txt": "你们以为黑总吹牛, 看图片领奖的憨憨"
            }
          ],
          "imgs": [
            {
              "url": "https://i.loli.net/2018/11/25/5bfaba1605b07.jpg"
            },
            {
              "url": "https://i.loli.net/2018/11/25/5bfaba16791c7.jpg"
            }
          ]
        }
      ]
    },
    {
      "month": "2015.01",
      "items": [
        {
          "id": "20150114",
          "title": "01.14 德云色二人组创色",
          "content": [
            {
              "txt": "德云色直播 斗鱼首秀！哟哟哟！我是发很多先生！ 旁边有个胖子很陌生！这个直播间的观众很真！从此都是德云色的人！ 西卡真的胖"
            }
          ],
          "imgs": [
            {
              "url": "https://i.loli.net/2018/10/30/5bd8404d9b422.jpg"
            }
          ]
        }
      ]
    },
    {
      "month": "2014.12",
      "items": [
        {
          "id": "20141213",
          "title": "12.13 2014年最佳解说 笑笑",
          "content": [
            {
              "txt": "毫无疑问，在英雄联盟职业比赛赛场上听不到笑笑的解说对于很多玩家来说是件非常遗憾的事情。笑笑作为前职业选手，他对于比赛局势的分析、细节的解读以及频频的口嗨都让大家记忆犹新。尤其是2014年世界总决赛OMG对阵NWS白盾一战，这场扬眉吐气的3比0更是让大家记住了笑笑那酣畅淋漓的解说。那些犀利的解说词依旧让人耳目一新，“这场比赛虽然只是一局我可以吹一个月！再赢一局我可以吹一年！打掉韩国队我吹一辈子！”"
            },
            {
              "txt": "“小伞的飞机在大哥胯下疯狂输出。”"
            },
            {
              "txt": "“这里看灵药是怎么玩的！告诉你一个男人是要做一辈子的懦夫还是一秒钟的英雄！挂个减速，全部留下!”"
            }
          ],
          "imgs": [
            {
              "url": "https://i.loli.net/2018/11/07/5be2867adf583.jpg"
            }
          ],
          "link": [
            {
              "url": "http://sports.qq.com/a/20171123/031376.htm",
              "title": "细数英雄联盟历年最佳解说 米勒二度当选笑笑独树一帜"
            },
            {
              "url": "http://lol.qq.com/news/detail.shtml?docid=8697514865306022585",
              "title": "OMG VS NWS 笑笑解说经典语录"
            }
          ]
        }
      ]
    },
    {
      "month": "2014.01",
      "items": [
        {
          "id": "20140120",
          "title": "01.20 iG·笑笑 下线",
          "content": [
            {
              "txt": "iG·笑笑 LOL退役"
            }
          ],
          "imgs": []
        }
      ]
    },
    {
      "month": "2013.11",
      "items": [
        {
          "id": "20131124",
          "title": "11.24 PE·西卡 LPL夺冠🏆",
          "content": [
            {
              "txt": "PE·西卡 与队伍 3:2 OMG 夺冠2013LPL夏季赛"
            }
          ],
          "imgs": [
            {
              "url": "https://i.loli.net/2018/10/30/5bd84047509c7.jpg"
            },
            {
              "url": "https://i.loli.net/2018/10/30/5bd8404aaa4cb.jpg"
            }
          ]
        }
      ]
    },
    {
      "month": "1993.06",
      "items": [
        {
          "id": "19930603",
          "title": "06.03李浩宇诞生",
          "content": [
            {
              "txt": "浩宇诞生"
            }
          ],
          "imgs": [
            {
              "url": "https://i.loli.net/2018/10/30/5bd84038b522d.jpg"
            }
          ]
        }
      ]
    },
    {
      "month": "1988.03",
      "items": [
        {
          "id": "19880324",
          "title": "03.24孙亚龙诞生",
          "content": [
            {
              "txt": "亚龙诞生"
            }
          ],
          "imgs": [
            {
              "url": "https://i.loli.net/2018/10/30/5bd84040a5654.jpg"
            }
          ]
        }
      ]
    }
  ]
}

// function s(data) {
//   console.log(data)
// }

// var desc = function(x,y)
// {
//   var x = x.month.split('.')
//   x = parseInt(`${x[0]}${x[1]}`)
//   var y = y.month.split('.')
//   y = parseInt(`${y[0]}${y[1]}`)
//   return (x < y) ? 1 : -1
// }

// s(JSON.stringify(data.events.sort(desc)))
